casapudenis/CY8CKIT-062-BLE/CE222221_Voice_Recorder01/CE222221_Voice_Recorder01.cydsn/Generated_Source/PSoC6/DMA_Record.h
/***************************************
*    Global Variables
***************************************/
extern uint8_t DMA_Record_initVar;

extern const cy_stc_dma_descriptor_config_t DMA_Record_PDM_to_SRAM_config;
extern cy_stc_dma_descriptor_t DMA_Record_PDM_to_SRAM;



/***************************************
*    In-line Function Implementation
***************************************/

/*******************************************************************************
* Function Name: DMA_Record_Stop
****************************************************************************//**
* Invokes the Cy_DMA_Channel_Disable() PDL driver function. 
*******************************************************************************/
__STATIC_INLINE void DMA_Record_Stop(void)
{
    Cy_DMA_Channel_Disable(DMA_Record_HW, DMA_Record_DW_CHANNEL);
}


/*******************************************************************************
* Function Name: DMA_Record_ChannelEnable
****************************************************************************//**
* Invokes the Cy_DMA_Channel_Enable() PDL driver function. 
*******************************************************************************/
__STATIC_INLINE void DMA_Record_ChannelEnable(void)
{
    Cy_DMA_Channel_Enable(DMA_Record_HW, DMA_Record_DW_CHANNEL);
}


/*******************************************************************************
* Function Name: DMA_Record_ChannelDisable
****************************************************************************//**
* Invokes the Cy_DMA_Channel_Disable() PDL driver function. 
*******************************************************************************/
__STATIC_INLINE void DMA_Record_ChannelDisable(void)
{
    Cy_DMA_Channel_Disable(DMA_Record_HW, DMA_Record_DW_CHANNEL);
}


/*******************************************************************************
* Function Name: DMA_Record_SetDescriptor
****************************************************************************//**
* Invokes the Cy_DMA_Channel_SetDescriptor() PDL driver function. 
*******************************************************************************/
__STATIC_INLINE void DMA_Record_SetDescriptor(cy_stc_dma_descriptor_t const * descriptor)
{
    Cy_DMA_Channel_SetDescriptor(DMA_Record_HW, DMA_Record_DW_CHANNEL, descriptor);
}


/*******************************************************************************
* Function Name: DMA_Record_GetDescriptor
****************************************************************************//**
* Invokes the Cy_DMA_Channel_GetCurrentDescriptor() PDL driver function.
*******************************************************************************/
__STATIC_INLINE cy_stc_dma_descriptor_t * DMA_Record_GetDescriptor(void)
{
    return(Cy_DMA_Channel_GetCurrentDescriptor(DMA_Record_HW, DMA_Record_DW_CHANNEL));
}


/*******************************************************************************
* Function Name: DMA_Record_SetNextDescriptor
****************************************************************************//**
* Invokes the Cy_DMA_Descriptor_SetNextDescriptor() PDL driver function. 
*******************************************************************************/
__STATIC_INLINE void DMA_Record_SetNextDescriptor(cy_stc_dma_descriptor_t const * descriptor)
{
    Cy_DMA_Descriptor_SetNextDescriptor(Cy_DMA_Channel_GetCurrentDescriptor(DMA_Record_HW, DMA_Record_DW_CHANNEL), descriptor);
}


/*******************************************************************************
* Function Name: DMA_Record_GetNextDescriptor
****************************************************************************//**
* Invokes the Cy_DMA_Descriptor_GetNextDescriptor() PDL driver function. 
*******************************************************************************/
__STATIC_INLINE cy_stc_dma_descriptor_t * DMA_Record_GetNextDescriptor(void)
{
    return(Cy_DMA_Descriptor_GetNextDescriptor(Cy_DMA_Channel_GetCurrentDescriptor(DMA_Record_HW, DMA_Record_DW_CHANNEL)));
}


/*******************************************************************************
* Function Name: DMA_Record_SetPriority
****************************************************************************//**
* Invokes the Cy_DMA_Channel_SetPriority() PDL driver function. 
*******************************************************************************/
__STATIC_INLINE void DMA_Record_SetPriority(uint32_t priority)
{
    Cy_DMA_Channel_SetPriority(DMA_Record_HW, DMA_Record_DW_CHANNEL, priority);
}


/*******************************************************************************
* Function Name: DMA_Record_GetPriority
****************************************************************************//**
* Invokes the Cy_DMA_Channel_GetPriority() PDL driver function.  
*******************************************************************************/
__STATIC_INLINE uint32_t DMA_Record_GetPriority(void)
{
    return (Cy_DMA_Channel_GetPriority(DMA_Record_HW, DMA_Record_DW_CHANNEL));
}


/*******************************************************************************
* Function Name: DMA_Record_SetSrcAddress
****************************************************************************//**
* Invokes the Cy_DMA_Descriptor_SetSrcAddress() PDL driver function. 
*******************************************************************************/
__STATIC_INLINE void DMA_Record_SetSrcAddress(cy_stc_dma_descriptor_t * descriptor, void const * srcAddress)
{
    Cy_DMA_Descriptor_SetSrcAddress(descriptor, srcAddress);
}


/*******************************************************************************
* Function Name: DMA_Record_GetSrcAddress
****************************************************************************//**
* Invokes the Cy_DMA_Descriptor_GetSrcAddress() PDL driver function. 
*******************************************************************************/
__STATIC_INLINE void * DMA_Record_GetSrcAddress(cy_stc_dma_descriptor_t const * descriptor)
{
    return(Cy_DMA_Descriptor_GetSrcAddress(descriptor));
}


